Merge pull request #271 from hoangsonww/fix/fix-git-ci
Add Kubernetes configuration files for blue/green & canary deployment
